Revit 2027 API
UITheme Enumeration
 The application frame theme.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum UITheme
Public Enumeration UITheme
public enum class UITheme
type UITheme
Members
Member name | Value | Description
Dark | 0 |  Dark.
Light | 1 |  Light.
See Also
Reference
Autodesk.Revit.UI Namespace